app/controllers/comments_controller.rb

	def create
		@post = Post.find_by slug: params[:post_id]
---
SELECT "posts".* FROM "posts" WHERE "posts"."slug" = 'a-marketing-company-disguised-as-a-search-egine' LIMIT 1