app/controllers/comments_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "2"]]
INSERT INTO "comments" ("body", "created_at", "post_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["body", "wow"], ["created_at", Thu, 03 Jul 2014 06:08:13 UTC +00:00], ["post_id", 2], ["updated_at", Thu, 03 Jul 2014 06:08:13 UTC +00:00], ["user_id", 3]]
---
	def create
		@post = Post.find(params[:post_id])
		@comment = @post.comments.build(params.require(:comment).permit(:body))
		@comment.user = current_user

		if @comment.save

SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT 1  [["id", "2"]]
INSERT INTO "votes" ("created_at", "updated_at", "user_id", "vote", "voteable_id", "voteable_type") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Sat, 05 Jul 2014 09:20:55 UTC +00:00], ["updated_at", Sat, 05 Jul 2014 09:20:55 UTC +00:00], ["user_id", 2], ["vote", true], ["voteable_id", 2], ["voteable_type", "Comment"]]
---
	def vote
		comment = Comment.find(params[:id])
		vote = Vote.create(voteable: comment, user: current_user, vote: params[:vote])