app/controllers/posts_controller.rb

INSERT INTO "posts" ("created_at", "description", "title", "updated_at", "url", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Thu, 03 Jul 2014 05:35:20 UTC +00:00], ["description", "test"], ["title", "hello"], ["updated_at", Thu, 03 Jul 2014 05:35:20 UTC +00:00], ["url", "google.com"], ["user_id", 3]]
---
  def create
    @post = Post.new(post_params)
    @post.user = current_user

    if @post.save