app/controllers/posts_controller.rb

  def vote
    @vote = Vote.create(voteable: @post, user: current_user, vote: params[:vote])
---
INSERT INTO "votes" ("created_at", "updated_at", "user_id", "vote", "voteable_id", "voteable_type") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Sat, 05 Jul 2014 08:40:19 UTC +00:00], ["updated_at", Sat, 05 Jul 2014 08:40:19 UTC +00:00], ["user_id", 2], ["vote", true], ["voteable_id", 7], ["voteable_type", "Post"]]

  def set_post
    @post = Post.find_by slug: params[:id]
---
SELECT "posts".* FROM "posts" WHERE "posts"."slug" = 'a-marketing-company-disguised-as-a-search-egine' LIMIT 1